app/views/messages/index.html.erb

<% for i in 0..10 %>
  <% if Message.find_by_user("ejemplo") %>
---
SELECT  "messages".* FROM "messages" WHERE "messages"."user" = ? LIMIT 1  [["user", "ejemplo"]]